HHyeon/stm32-connectivity/Projects/STM32H747I-DISCO/Applications/wifi_scan/Middlewares/Third_Party/Infineon_Wireless_Connectivity/wifi-connection-manager/include/cy_wcm.h
/*
 * Copyright 2021, Cypress Semiconductor Corporation (an Infineon company) or
 * an affiliate of Cypress Semiconductor Corporation.  All rights reserved.
 *
 * This software, including source code, documentation and related
 * materials ("Software") is owned by Cypress Semiconductor Corporation
 * or one of its affiliates ("Cypress") and is protected by and subject to
 * worldwide patent protection (United States and foreign),
 * United States copyright laws and international treaty provisions.
 * Therefore, you may use this Software only as provided in the license
 * agreement accompanying the software package from which you
 * obtained this Software ("EULA").
 * If no EULA applies, Cypress hereby grants you a personal, non-exclusive,
 * non-transferable license to copy, modify, and compile the Software
 * source code solely for use in connection with Cypress's
 * integrated circuit products.  Any reproduction, modification, translation,
 * compilation, or representation of this Software except as specified
 * above is prohibited without the express written permission of Cypress.
 *
 * Disclaimer: THIS SOFTWARE IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND,
 * EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, NONINFRINGEMENT, IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. Cypress
 * reserves the right to make changes to the Software without notice. Cypress
 * does not assume any liability arising out of the application or use of the
 * Software or any product or circuit described in the Software. Cypress does
 * not authorize its products for use in any products where a malfunction or
 * failure of the Cypress product may reasonably be expected to result in
 * significant property damage, injury or death ("High Risk Product"). By
 * including Cypress's product in a High Risk Product, the manufacturer
 * of such system or application assumes all risk of such use and in doing
 * so agrees to indemnify Cypress against all liability.
*/

/**
* @file cy_wcm.h
* @brief Wi-Fi Connection Manager (WCM) is a library that helps application developers manage their Wi-Fi connectivity.
* The library provides a set of APIs that can be used to establish and monitor Wi-Fi connections on Cypress platforms that support Wi-Fi connectivity.
* The library APIs are thread-safe. The library monitors the Wi-Fi connection and notifies the connection state change through an event notification mechanism.
* The library also provides APIs to connect to a Wi-Fi network using Wi-Fi Protected Setup (WPS) methods.
* See individual APIs for more details.
* WPS is disabled by default. WPS uses Mbed TLS security stack. Enable the following components for WPS.
* COMPONENTS+=WPS MBEDTLS
*/


#pragma once

#ifdef __cplusplus
extern "C" {
#endif

#include "cy_result.h"
#include "cy_wcm_error.h"

#if defined(__ICCARM__)
#define CYPRESS_WEAK            __WEAK
#define CYPRESS_PACKED(struct)  __packed struct
#elif defined(__GNUC__) || defined(__clang__) || defined(__CC_ARM)
#define CYPRESS_WEAK            __attribute__((weak))
#define CYPRESS_PACKED(struct)  struct __attribute__((packed))
#else
#define CYPRESS_WEAK           __attribute__((weak))
#define CYPRESS_PACKED(struct) struct __attribute__((packed))
#endif  /* defined(__ICCARM__) */

/**
 * \defgroup group_wcm_mscs Message Sequence Charts
 * \defgroup group_wcm_macros Macros
 * \defgroup group_wcm_enums Enumerated Types
 * \defgroup group_wcm_typedefs Typedefs
 * \defgroup group_wcm_structures Structures
 * \defgroup group_wcm_functions Functions
 */

/**
*
* \addtogroup group_wcm_mscs
* \{
*
********************************************************************************
* \section section_wps_enrollee WPS Enrollee
********************************************************************************
*
* \image html uml_wps_enrollee.png
*
* \}
*
*/

/**
 * \addtogroup group_wcm_macros
 * \{
 */

/******************************************************
 *                    Constants
 ******************************************************/
#define CY_WCM_MAX_SSID_LEN                (32)        /**< Max SSID length.                       */
#define CY_WCM_MAX_PASSPHRASE_LEN          (64)        /**< Max passphrase length.                 */
#define CY_WCM_MAC_ADDR_LEN                (6)         /**< MAC address length.                    */
#define CY_WCM_MAX_IE_LENGTH               (3)         /**< Maximum Length of Information Element  */
#define WEP_ENABLED                        0x0001      /**< Flag to enable WEP security.           */
#define TKIP_ENABLED                       0x0002      /**< Flag to enable TKIP encryption.        */
#define AES_ENABLED                        0x0004      /**< Flag to enable AES encryption.         */
#define SHARED_ENABLED                     0x00008000  /**< Flag to enable shared key security.    */
#define WPA_SECURITY                       0x00200000  /**< Flag to enable WPA security.           */
#define WPA2_SECURITY                      0x00400000  /**< Flag to enable WPA2 security.          */
#define WPA3_SECURITY                      0x01000000  /**< Flag to enable WPA3 PSK security.      */
#define ENTERPRISE_ENABLED                 0x02000000  /**< Flag to enable enterprise security.    */
#define WPS_ENABLED                        0x10000000  /**< Flag to enable WPS security.           */
#define IBSS_ENABLED                       0x20000000  /**< Flag to enable IBSS mode.              */
#define FBT_ENABLED                        0x40000000  /**< Flag to enable FBT.                    */

/** WPS password length for PIN mode. */
#define CY_WCM_WPS_PIN_LENGTH              (9)

/** Maximum number of callbacks that can be registered with the WCM library. */
#define CY_WCM_MAXIMUM_CALLBACKS_COUNT     (5)

/** \} group_wcm_macros */

/**
 * \addtogroup group_wcm_enums
 * \{
 */

/******************************************************
 *            Enumerations
 ******************************************************/

/**
 * IP Version
 */
typedef enum
{
    CY_WCM_IP_VER_V4 = 4,      /**< Denotes IPv4 version. */
    CY_WCM_IP_VER_V6 = 6       /**< Denotes IPv6 version. */
} cy_wcm_ip_version_t;

/**
 * IPV6 types
 */
typedef enum
{
    CY_WCM_IPV6_LINK_LOCAL = 0,  /**< Denotes IPv6 link-local address type. */
    CY_WCM_IPV6_GLOBAL           /**< Denotes IPv6 global address type. */
} cy_wcm_ipv6_type_t;

/**
 * Enumeration of Wi-Fi Security Modes
 */
typedef enum
{
    CY_WCM_SECURITY_OPEN               = 0,                                                                   /**< Open security.                                         */
    CY_WCM_SECURITY_WEP_PSK            = WEP_ENABLED,                                                         /**< WEP PSK security with open authentication.             */
    CY_WCM_SECURITY_WEP_SHARED         = ( WEP_ENABLED   | SHARED_ENABLED ),                                  /**< WEP PSK security with shared authentication.           */
    CY_WCM_SECURITY_WPA_TKIP_PSK       = ( WPA_SECURITY  | TKIP_ENABLED ),                                    /**< WPA PSK security with TKIP.                            */
    CY_WCM_SECURITY_WPA_AES_PSK        = ( WPA_SECURITY  | AES_ENABLED ),                                     /**< WPA PSK security with AES.                             */
    CY_WCM_SECURITY_WPA_MIXED_PSK      = ( WPA_SECURITY  | AES_ENABLED | TKIP_ENABLED ),                      /**< WPA PSK security with AES and TKIP.                    */
    CY_WCM_SECURITY_WPA2_AES_PSK       = ( WPA2_SECURITY | AES_ENABLED ),                                     /**< WPA2 PSK security with AES.                            */
    CY_WCM_SECURITY_WPA2_TKIP_PSK      = ( WPA2_SECURITY | TKIP_ENABLED ),                                    /**< WPA2 PSK security with TKIP.                           */
    CY_WCM_SECURITY_WPA2_MIXED_PSK     = ( WPA2_SECURITY | AES_ENABLED | TKIP_ENABLED ),                      /**< WPA2 PSK security with AES and TKIP.                   */
    CY_WCM_SECURITY_WPA2_FBT_PSK       = ( WPA2_SECURITY | AES_ENABLED | FBT_ENABLED),                        /**< WPA2 FBT PSK security with AES and TKIP.               */
    CY_WCM_SECURITY_WPA3_SAE           = ( WPA3_SECURITY | AES_ENABLED ),                                     /**< WPA3 security with AES.                                */
    CY_WCM_SECURITY_WPA2_WPA_AES_PSK   = (WPA2_SECURITY | WPA_SECURITY | AES_ENABLED),                        /**< WPA2 WPA PSK Security with AES                         */
    CY_WCM_SECURITY_WPA2_WPA_MIXED_PSK = (WPA2_SECURITY | WPA_SECURITY | AES_ENABLED | TKIP_ENABLED),         /**< WPA2 WPA PSK Security with AES & TKIP.                  */
    CY_WCM_SECURITY_WPA3_WPA2_PSK      = ( WPA3_SECURITY | WPA2_SECURITY | AES_ENABLED ),                     /**< WPA3 WPA2 PSK security with AES.                       */
    CY_WCM_SECURITY_WPA_TKIP_ENT       = (ENTERPRISE_ENABLED | WPA_SECURITY | TKIP_ENABLED),                  /**< WPA Enterprise Security with TKIP.                      */
    CY_WCM_SECURITY_WPA_AES_ENT        = (ENTERPRISE_ENABLED | WPA_SECURITY | AES_ENABLED),                   /**< WPA Enterprise Security with AES                       */
    CY_WCM_SECURITY_WPA_MIXED_ENT      = (ENTERPRISE_ENABLED | WPA_SECURITY | AES_ENABLED | TKIP_ENABLED),    /**< WPA Enterprise Security with AES and TKIP.                */
    CY_WCM_SECURITY_WPA2_TKIP_ENT      = (ENTERPRISE_ENABLED | WPA2_SECURITY | TKIP_ENABLED),                 /**< WPA2 Enterprise Security with TKIP.                     */
    CY_WCM_SECURITY_WPA2_AES_ENT       = (ENTERPRISE_ENABLED | WPA2_SECURITY | AES_ENABLED),                  /**< WPA2 Enterprise Security with AES.                      */
    CY_WCM_SECURITY_WPA2_MIXED_ENT     = (ENTERPRISE_ENABLED | WPA2_SECURITY | AES_ENABLED | TKIP_ENABLED),   /**< WPA2 Enterprise Security with AES and TKIP.               */
    CY_WCM_SECURITY_WPA2_FBT_ENT       = (ENTERPRISE_ENABLED | WPA2_SECURITY | AES_ENABLED | FBT_ENABLED),    /**< WPA2 Enterprise Security with AES and FBT.                */

    CY_WCM_SECURITY_IBSS_OPEN          = ( IBSS_ENABLED ),                                                    /**< Open security on IBSS ad hoc network.                  */
    CY_WCM_SECURITY_WPS_SECURE         = ( WPS_ENABLED | AES_ENABLED),                                        /**< WPS with AES security.                                 */

