HHyeon/stm32-connectivity/Projects/STM32H747I-DISCO/Applications/wifi_scan/Middlewares/Third_Party/Infineon_Wireless_Connectivity/wifi-connection-manager/include/cy_wcm.h
/**
 * Connects the STA interface to a AP using the Wi-Fi credentials and configuration parameters provided.
 * On successful connection to the Wi-Fi network, the API returns the IP address.
 *
 * This API is a blocking call; this function additionally performs the following checks:
 * 1) Checks for and ignores duplicate connect requests to an already connected AP.
 * 2) Checks the current connection state; if already connected, disconnects from the current
 *    Wi-Fi network and connects to the new Wi-Fi network.
 *
 * @param[in]   connect_params      : Configuration to join the AP.
 * @param[out]  ip_addr             : Pointer to return the IP address (optional).
 *
 * \note WEP (Wired Equivalent Privacy) security is not supported by this API.
 *       WEP based authentication types are considered to be weaker security types,
 *       hence this function doesn't connect to AP that is configured with WEP based authentication.
 *
 * @return CY_RSLT_SUCCESS if connection is successful; returns [WCM-specific error codes](./cy_wcm_error.h) otherwise.
 */
cy_rslt_t cy_wcm_connect_ap(const cy_wcm_connect_params_t *connect_params, cy_wcm_ip_address_t *ip_addr);

/**
 * Disconnects the STA interface from the currently connected AP.
 *
 * @return CY_RSLT_SUCCESS if disconnection was successful or if the device is already
 * disconnected; returns [WCM-specific error codes](./cy_wcm_error.h) otherwise.
 */
cy_rslt_t cy_wcm_disconnect_ap(void);

/**
 * Retrieves the IPv4 address of the given interface. See \ref cy_wcm_get_ipv6_addr API to get IPv6 addresses.
 *
 * @param[in]   interface_type  : Type of the WCM interface.
 * @param[out]  ip_addr         : Pointer to an IP address structure (or) an IP address structure array.
 *                                If the given interface is CY_WCM_INTERFACE_TYPE_STA or CY_WCM_INTERFACE_TYPE_AP upon return, index-0 stores the IPv4 address of the interface.
 *                                If the given interface type is CY_WCM_INTERFACE_TYPE_AP_STA, index-0 stores the IPv4 address of the STA interface and index-1 stores the IPV4 address of the AP interface.
 * @param[in]   addr_count      : Length of the array passed in ip_addr.
 *
 * @return CY_RSLT_SUCCESS if IP-address get is successful; returns [WCM-specific error codes](./cy_wcm_error.h) otherwise.

 */
cy_rslt_t cy_wcm_get_ip_addr(cy_wcm_interface_t interface_type, cy_wcm_ip_address_t *ip_addr, uint8_t addr_count);

/**
 * Retrieves the IPv6 address of the given interface.
 *
 * Note: Currently this API supports only \ref CY_WCM_IPV6_LINK_LOCAL type.
 *
 * @param[in]   interface_type  : Type of the WCM interface.
 * @param[in]   ipv6_addr_type  : IPv6 address type.
 * @param[out]  ip_addr         : Pointer to an IP address structure (or) an IP address structure array.
 *                                If the given interface is CY_WCM_INTERFACE_TYPE_STA or CY_WCM_INTERFACE_TYPE_AP upon return, index-0 stores the IPv6 link-local address of the interface.
 *                                If the given interface type is CY_WCM_INTERFACE_TYPE_AP_STA, index-0 stores the IPv6 link-local address of the STA interface and index-1 stores the IPv6 link-local address of the AP interface.
 * @param[in]   addr_count      : Length of the array passed in ip_addr.
 *
 * @return CY_RSLT_SUCCESS if IPv6 interface is up and IPv6 address is ready; returns [WCM-specific error codes](./cy_wcm_error.h) otherwise.
 */
cy_rslt_t cy_wcm_get_ipv6_addr(cy_wcm_interface_t interface_type, cy_wcm_ipv6_type_t ipv6_addr_type, cy_wcm_ip_address_t *ip_addr, uint8_t addr_count);

/**
 * Retrieves the gateway IP address of the given interface.
 *
 * @param[in]   interface_type  : Type of the WCM interface.
 * @param[out]  gateway_addr    : Pointer to a single structure or an array of structures to be filled with the gateway IP address or addresses.
 *                                If the given interface is CY_WCM_INTERFACE_TYPE_STA or CY_WCM_INTERFACE_TYPE_AP upon return, index-0 stores the IPv4 gateway address of the interface.
 *                                If the given interface type is CY_WCM_INTERFACE_TYPE_AP_STA, index-0 stores the IPv4 gateway address of the STA interface and index-1 stores the IPV4 gateway address of the AP interface.
 *                                In future, IPv6 addresses will be supported.
 *
 * @param[in]   addr_count      : Length of the array passed in gateway_addr.
 *
 * @return CY_RSLT_SUCCESS if retrieval of the gateway IP address was successful; returns [WCM-specific error codes](./cy_wcm_error.h) otherwise.
 */
cy_rslt_t cy_wcm_get_gateway_ip_address(cy_wcm_interface_t interface_type, cy_wcm_ip_address_t *gateway_addr, uint8_t addr_count);


/**
 * Retrieves the subnet mask address of the given interface.
  *
 * @param[in]   interface_type  : Type of the WCM interface.
 * @param[out]  net_mask_addr   : Pointer to a single structure or an array of structures to be filled with the subnet mask address or masks.
 *                                If the given interface is CY_WCM_INTERFACE_TYPE_STA or CY_WCM_INTERFACE_TYPE_AP upon return, index-0 stores the subnet mask address of the interface.
 *                                If the given interface type is CY_WCM_INTERFACE_TYPE_AP_STA, index-0 stores the subnet mask address of the STA interface and index-1 stores the subnet mask address of the AP interface.
 *
 * @param[in]   addr_count      : Length of the array passed in net_mask_addr.
 *
 * @return CY_RSLT_SUCCESS if retrieval of the subnet mask address was successful; returns [WCM-specific error codes](./cy_wcm_error.h) otherwise.
 */
cy_rslt_t cy_wcm_get_ip_netmask(cy_wcm_interface_t interface_type, cy_wcm_ip_address_t *net_mask_addr, uint8_t addr_count);

/**
 * Retrieves the MAC address of the given interface.
 *
 * @param[in]   interface_type  : Type of the WCM interface.
 * @param[out]  mac_addr        : Pointer to a MAC address structure (or) a MAC address structure array.
 *                                If the given interface is CY_WCM_INTERFACE_TYPE_STA or CY_WCM_INTERFACE_TYPE_AP upon return, index-0 stores the MAC address of the interface.
 *                                If the given interface type is CY_WCM_INTERFACE_TYPE_AP_STA, index-0 stores the MAC address of the STA interface and index-1 stores the MAC address of the AP interface.
 *
 * @param[in]   addr_count      : Length of the array passed in mac_addr.
 * 
 * @return CY_RSLT_SUCCESS if the MAC address get is successful; returns [WCM-specific error codes](./cy_wcm_error.h) otherwise.
 */
cy_rslt_t cy_wcm_get_mac_addr(cy_wcm_interface_t interface_type, cy_wcm_mac_t *mac_addr, uint8_t addr_count);

/**
 * Negotiates securely with a Wi-Fi Protected Setup (WPS) Registrar (usually an
 *  AP) and obtains the Wi-Fi network credentials.
 *
 * @param[in]  config               : Pointer to the WPS configuration information.
 * @param[in]  details              : Pointer to a structure containing manufacturing details
 *                                    of this device.
 * @param[out] credentials          : Pointer to an array of credentials structure \ref cy_wcm_wps_credential_t to receive the AP credentials.
 * @param[in, out] credential_count : Upon invocation, this parameter stores the size of the credentials parameter. Upon return, denotes the actual
 *                                    number of credentials returned.
 *
 * @return CY_RSLT_SUCCESS if credentials are retrieved successfully; returns [WCM-specific error codes](./cy_wcm_error.h) otherwise.
 */
cy_rslt_t cy_wcm_wps_enrollee(cy_wcm_wps_config_t* config, const cy_wcm_wps_device_detail_t *details, cy_wcm_wps_credential_t *credentials, uint16_t *credential_count);

/**
 * Generates random WPS PIN for PIN mode connection.
 *
 * @param[out]  wps_pin_string  : Pointer to store the WPS PIN as a null-terminated string.
 *
 * @return CY_RSLT_SUCCESS if WPS PIN generated; returns [WCM-specific error codes](./cy_wcm_error.h) otherwise.
 */
cy_rslt_t cy_wcm_wps_generate_pin(char wps_pin_string[CY_WCM_WPS_PIN_LENGTH]);

/**
 * Registers an event callback to monitor the connection and IP address change events.
 * This is an optional registration; use it if the application needs to monitor events across disconnection and reconnection of STA interface and notifies the clients which are connected or disconnected from the SoftAP.
 *
 * Note: This API is expected to be called typically while being connected to an AP or once the SoftAP is up.
 *
 * @param[in]  event_callback  : Callback function to be invoked for event notification.
 *                               The callback will be executed in the context of the WCM.
 *
 * @return CY_RSLT_SUCCESS if application callback registration was successful; returns [WCM-specific error codes](./cy_wcm_error.h) otherwise.
*/
cy_rslt_t cy_wcm_register_event_callback(cy_wcm_event_callback_t event_callback);

/**
 * De-registers an event callback.
 *
 * @param[in]  event_callback  : Callback function to de-register from getting notifications.
 *
 * @return CY_RSLT_SUCCESS if application callback de-registration was successful; returns [WCM-specific error codes](./cy_wcm_error.h) otherwise.
*/
cy_rslt_t cy_wcm_deregister_event_callback(cy_wcm_event_callback_t event_callback);

/**
 * Checks if the STA interface is connected to an AP.
 *
 * @return 1 if connected, 0 otherwise.
 */
uint8_t cy_wcm_is_connected_to_ap(void);

/**
 * This function retrieves the information such as SSID, BSSID, and other details of the AP to which the STA interface is connected.
 *
 * @param[out] ap_info : Pointer to store the information of the associated AP \ref cy_wcm_associated_ap_info_t.
 *
 * @return CY_RSLT_SUCCESS if retrieving the information of the associated AP was successful; returns [WCM-specific error codes](./cy_wcm_error.h) otherwise.
 */
cy_rslt_t cy_wcm_get_associated_ap_info(cy_wcm_associated_ap_info_t *ap_info);

/**
 * This function gets the WLAN statistics of the given interface from the time WLAN driver is up and running.
 *
 * The application would typically use this API to get information such as "total transmitted packets" and "total received packets"; 
 * for more details, see members of \ref cy_wcm_wlan_statistics_t.
 *
 * @param[in] interface : Type of the WCM interface.
 * @param[in] stat      : Pointer to store the statistics \ref cy_wcm_wlan_statistics_t.
 *
 * @return CY_RSLT_SUCCESS if retrieval of statistics was successful; returns [WCM-specific error codes](./cy_wcm_error.h) otherwise.
 */
cy_rslt_t cy_wcm_get_wlan_statistics(cy_wcm_interface_t interface, cy_wcm_wlan_statistics_t *stat);

/**
 * Retrieves the MAC address of the gateway for STA interface. Uses Address Resolution Protocol (ARP) to retrieve the gateway MAC address.
 *
 * This function is a blocking call and uses an internal timeout while running ARP.
 *
 * @param[out]  mac_addr : Pointer to a MAC address structure which is filled with the gateway's MAC address on successful return.
 *
 * @return CY_RSLT_SUCCESS if retrieval of the gateway MAC address was successful; returns [WCM-specific error codes](./cy_wcm_error.h) otherwise.
 */
cy_rslt_t cy_wcm_get_gateway_mac_address(cy_wcm_mac_t *mac_addr);

/**
 * Sends a ping request to the given IP address. This function is a blocking call; it returns after the specified timeout.
 *
 * @param[in]  interface   : Type of the WCM interface.
 * @param[in]  ip_addr     : Pointer to the destination IP address structure to which the ping request will be sent.
 * @param[in]  timeout_ms  : Ping request timeout in milliseconds.
 * @param[out] elapsed_ms  : Pointer to store the round-trip time (in milliseconds),
 *                           i.e., the time taken to receive the ping response from the destination.
 *
 * @return CY_RSLT_SUCCESS if pinging to the IP address was successful; returns [WCM-specific error codes](./cy_wcm_error.h) otherwise.
 */
cy_rslt_t cy_wcm_ping(cy_wcm_interface_t interface, cy_wcm_ip_address_t *ip_addr, uint32_t timeout_ms, uint32_t* elapsed_ms);


/**
 * Start an infrastructure Wi-Fi network (SoftAP).
 * This API is a blocking call; this function adds the Information Element to the SoftAP and starts an internal DHCP server.
 *
 * @param[in]   ap_config   : Configuration parameters for the SoftAP.
 *
 * @return CY_RSLT_SUCCESS if SoftAp is started ; returns [WCM-specific error codes](./cy_wcm_error.h) otherwise.
 */
cy_rslt_t cy_wcm_start_ap(const cy_wcm_ap_config_t *ap_config);

/**
 * Stops the infrastructure Wi-Fi network (SoftAP), removes the Information Element and stops the internal DHCP server.
 *
 * @return CY_RSLT_SUCCESS if connection is successful; returns [WCM-specific error codes](./cy_wcm_error.h) otherwise.
 */
cy_rslt_t cy_wcm_stop_ap(void);

/**
 * Gets the MAC address of the clients associated with the SoftAP.
 *
 * @param[out] sta_list    : Pointer to MAC address (or) array of MAC addresses. The client's (STA) MAC address is stored on this array before the function returns.
 *
 * @param[in]  num_clients : Length of the array passed in sta_list.
 *
 * \note If the number of connected client are less than the num_clients, then elements of sta_list beyond number of connected clients will be set to zero.
 *       Maximum number of supported client list varies for different Wi-Fi chips.
 *
 * @return CY_RSLT_SUCCESS If getting the client list is successful; returns [WCM-specific error codes](./cy_wcm_error.h) otherwise.
 */
cy_rslt_t cy_wcm_get_associated_client_list(cy_wcm_mac_t *sta_list, uint8_t num_clients);

/** \} group_wcm_functions */


#ifdef __cplusplus
} /* extern C */
#endif
